app/controllers/registrations_controller.rb

  def show
    @registration = Registration.find(params[:id])
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 1)

  def edit
    @registration = Registration.find(params[:id])
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 2)

  def create
    @registration = Registration.new(params[:registration])

    respond_to do |format|
      if @registration.save
---
INSERT INTO "registrations" ("name", "created_at", "updated_at", "last_name", "mode_of_reach", "one_line_abstract", "phone_no", "email") VALUES('Arvind', '2010-03-11 10:20:27', '2010-03-11 10:20:27', 'Kunday', 'TW.com', 'Bla Bla Bla', 9677010095, 'kunday@gmail.com')

  def destroy
    @registration = Registration.find(params[:id])
    @registration.destroy
---
SELECT * FROM "registrations" WHERE ("registrations"."id" = 9)
DELETE FROM "registrations" WHERE "id" = 9